package chapter12_collection;

import java.util.ArrayList;
import java.util.List;

public class Collection01_ArrayList_Basic {

    public static void main(String[] args) {

        /*
         * ============================================
         * 1. 컬렉션(Collection)이란?
         * ============================================
         *
         * 여러 개의 데이터를 저장하기 위한
         * 자료구조를 제공하는 프레임워크
         *
         * 배열과 차이점
         *
         * 배열
         * - 크기가 고정
         *
         * 컬렉션
         * - 크기가 자동으로 늘어남
         *
         */


        /*
         * ============================================
         * 2. List 인터페이스
         * ============================================
         *
         * List 특징
         *
         * 1️. 순서가 있다
         * 2️. 중복 데이터 허용
         * 3️. index로 접근 가능
         *
         * 예
         *
         * [10, 20, 30, 20]
         */


        /*
         * ============================================
         * 3. ArrayList란?
         * ============================================
         *
         * List 인터페이스의 대표 구현 클래스
         *
         * 내부적으로 배열을 사용하여
         * 데이터를 관리한다.
         *
         * 특징
         *
         *  조회 속도 빠름
         *  데이터 추가 쉬움
         *  중간 삭제 시 성능 조금 느림
         */


        /*
         * ============================================
         * 4. ArrayList 생성
         * ============================================
         */

        List<String> list = new ArrayList<>();


        /*
         * List<String>
         *
         * String 타입만 저장 가능
         *
         * Generics (제네릭)
         * 타입 안정성을 위해 사용
         */


        /*
         * ============================================
         * 5. 데이터 추가 (add)
         * ============================================
         */

        list.add("Java");
        list.add("Spring");
        list.add("React");
        list.add("Database");
        list.add("Java"); // 중복 허용


        /*
         * 현재 리스트 상태
         *
         * index
         * 0 -> Java
         * 1 -> Spring
         * 2 -> React
         * 3 -> Database
         * 4 -> Java
         */


        System.out.println("전체 리스트 : " + list);


        /*
         * ============================================
         * 6. 데이터 조회 (get)
         * ============================================
         *
         * index를 이용하여 데이터 접근
         */

        String first = list.get(0);
        String second = list.get(1);

        System.out.println("첫번째 데이터 : " + first);
        System.out.println("두번째 데이터 : " + second);


        /*
         * ============================================
         * 7. 리스트 크기 (size)
         * ============================================
         */

        System.out.println("리스트 크기 : " + list.size());


        /*
         * ============================================
         * 8. 데이터 수정 (set)
         * ============================================
         *
         * 특정 index의 값을 변경
         */

        list.set(1, "SpringBoot");

        System.out.println("수정 후 리스트 : " + list);


        /*
         * ============================================
         * 9. 데이터 삭제 (remove)
         * ============================================
         *
         * index 기준 삭제
         */

        list.remove(2);

        System.out.println("삭제 후 리스트 : " + list);


        /*
         * ============================================
         * 10. 포함 여부 확인 (contains)
         * ============================================
         */

        boolean check = list.contains("Java");

        System.out.println("Java 존재 여부 : " + check);


        /*
         * ============================================
         * 11. 반복문으로 출력
         * ============================================
         */

        System.out.println("for문 출력");

        for(int i = 0; i < list.size(); i++) {

            System.out.println("index " + i + " -> " + list.get(i));

        }


        /*
         * ============================================
         * 12. 향상된 for문 (for-each)
         *
         * ============================================
         */

        System.out.println("향상된 for문");

        int index = 0;
        for(String data : list) {

            System.out.println("index " + index + "-> " + data);
            index ++;
        }


        /*
         * ============================================
         * 13. 전체 삭제 (clear)
         * ============================================
         */

        list.clear();

        System.out.println("전체 삭제 후 크기 : " + list.size());


        /*
         * ============================================
         * 14. ArrayList 정리
         * ============================================
         *
         *  순서 유지
         *  중복 허용
         *  index 접근 가능
         *  크기 자동 증가
         *
         * 가장 많이 사용하는 컬렉션
         */
    }
}