package chapter12_collection;

import java.util.HashSet;
import java.util.Set;

public class Collection02_HashSet_Basic {

    public static void main(String[] args) {

        /*
         * ============================================
         * 1. Set이란?
         * ============================================
         *
         * Set 특징
         *
         * 1. 중복 허용하지 않음
         * 2️. 순서 없음
         * 3. 빠른 검색
         *
         * 대표 구현 클래스
         *
         * HashSet
         */


        /*
         * ============================================
         * 2. HashSet 생성
         * ============================================
         */

        Set<String> set = new HashSet<>();


        /*
         * ============================================
         * 3. 데이터 추가 (add)
         * ============================================
         */

        set.add("Java");
        set.add("Spring");
        set.add("React");
        set.add("Database");

        // 중복 데이터
        set.add("Java");
        set.add("Spring");


        /*
         * HashSet 결과
         *
         * 중복 제거됨
         */


        System.out.println("Set 데이터 : " + set);


        /*
         * ============================================
         * 4. 데이터 개수
         * ============================================
         */

        System.out.println("데이터 개수 : " + set.size());


        /*
         * ============================================
         * 5. 데이터 존재 여부 확인
         * ============================================
         */

        boolean check = set.contains("Java");

        System.out.println("Java 존재 여부 : " + check);


        /*
         * ============================================
         * 6. 데이터 삭제
         * ============================================
         */

        set.remove("React");

        System.out.println("삭제 후 : " + set);


        /*
         * ============================================
         * 7. 전체 출력
         * ============================================
         */

        for(String data : set) {

            System.out.println("값 : " + data);

        }


        /*
         * ============================================
         * 8. 전체 삭제
         * ============================================
         */

        set.clear();

        System.out.println("삭제 후 크기 : " + set.size());


        /*
         * ============================================
         * 9. HashSet 정리
         * ============================================
         *
         *  중복 제거
         *  순서 없음
         *  검색 빠름
         *
         */
    }
}